export const quotes = [
  {
    id: 1,
    content: "我见青山多妩媚，料青山见我应如是",
    author: "辛弃疾",
    source: "《贺新郎·甚矣吾衰矣》",
    date: "2025-12-18"
  },
  {
    id: 2,
    content: "我与我周旋久，宁作我。",
    author: "世说新语",
    source: "《品藻》",
    date: "2025-12-18"
  },
  {
    id: 3,
    content: "功不唐捐，久久为功",
    author: "佚名",
    source: "",
    date: "2025-12-18"
  },
  {
    id: 4,
    content: "世界上只有一种英雄主义，就是在认清生活真相之后依然热爱生活。",
    author: "罗曼·罗兰",
    source: "《米开朗基罗传》",
    date: "2025-12-18"
  },
  {
    id: 5,
    content: "滚滚长江东逝水，浪花淘尽英雄.",
    author: "杨慎",
    source: "《临江仙·滚滚长江东逝水》",
    date: "2025-12-18"
  },
  {
    id: 6,
    content: "少年听雨歌楼上，红烛昏罗帐。壮年听雨客舟中，江阔云低、断雁叫西风。而今听雨僧庐下，鬓已星星也。悲欢离合总无情，一任阶前、点滴到天明。",
    author: "蒋捷",
    source: "《虞美人-听雨》",
    date: "2025-12-18"
  },
    {
        id:7 ,
        content: "光阴如骏马加鞭，日月如落花流水",
        author: "轶名",
        source: "《大明风华》",
        date: "2025-12-20"
    }a
]
