export const thoughts = [
  {
    id: 1,
    date: "2025-12-18",
    week: "星期四",
    content: "基本完成所有功能的搭建",
    likes: 1,
    comments: 0
  },
  {
    id: 2,
    date: "2025-12-17",
    week: "星期三",
    content: "尝试上线，利用vercel.com,但是服务器在外国，需要搭梯子",
    likes: 0,
    comments: 0
  },
  {
    id: 3,
    date: "2025-12-13",
    week: "星期六",
    content: "最开始是运行时渲染，md文件一大直接卡死线程，网页崩溃。随后采取构建期渲染，页面秒开，代价是无法再新增或修改文章内容.",
    likes: 0,
    comments: 0
  },
    {
    id: 4,
    date: "2025-12-11",
    week: "星期四",
    content: "关于markdown渲染问题，尝试一天：vue3内嵌入astro失败，随后尝试markdown-it.",
    likes: 0,
    comments: 0
  },
  {
    id: 5,
    date: "2025-12-01",
    week: "星期一",
    content: "我想搭建一个blog",
    likes: 0,
    comments: 0
  },
  {
    id: 6,
    date: "2024-12-25",
    week: "星期三",
    content: "Merry Christmas! 🎄 希望明年的自己能更好。",
    likes: 5,
    comments: 2
  },
    {
        id: 7,
        date: "2025-12-19",
        week: "星期五",
        content: "还有五天就要考数字逻辑了，从零开始的生活",
        likes: 5,
        comments: 2
    },
{
    id: 8,
        date: "2025-12-20",
    week: "星期六",
    content: "数字逻辑考试太简单了，一天绰绰有余",
    likes: 5,
    comments: 2
}

]
